> Somehow terraform plan always reports the field key as changed.

Here are steps to reproduce:
* Create a resource like this:

```hcl
resource "gitlab_user_gpgkey" "yan12125" {
    key = <<KEY
-----BEGIN PGP PUBLIC KEY BLOCK-----

xxx
-----END PGP PUBLIC KEY BLOCK-----
KEY
}
```

* Import the existing key with `terraform import gitlab_user_gpgkey.yan12125 123`, where 123 is the key ID for the current user.
* `terraform plan` reports changed resource: (personal information removed)

```
Warning: Provider development overrides are in effect

The following provider development overrides are set in the CLI configuration:
 - gitlabhq/gitlab in /home/yen/Projects/terraform-provider-gitlab

The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
gitlab_user_gpgkey.yan12125: Refreshing state... [id=130860]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # gitlab_user_gpgkey.yan12125 must be replaced
-/+ resource "gitlab_user_gpgkey" "yan12125" {
      ~ created_at = "2022-07-19T16:45:31Z" -> (known after apply)
      ~ id         = "123" -> (known after apply)
      ~ key        = <<-EOT # forces replacement
            -----BEGIN PGP PUBLIC KEY BLOCK-----
            
            xxx
            -----END PGP PUBLIC KEY BLOCK-----
        EOT
      ~ key_id     = 123 -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

The key recorded in terraform.tfstate is the same as my actual key, but somehow my code makes terraform treat them as different.